testCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-10  -10  0 )
    (-10  -10  100)
    ( 10  -10  100)
    ( 10  -10  0 )

    (-10   10  0 )
    (-10   10  100)
    ( 10   10  100)
    ( 10   10  0 )
);


blocks
(
     hex (0 1 2 3 4 5 6 7) (21 21 51) simpleGrading (1 1 1)
);

edges
(

); 


boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (0 1 5 4)
            (0 1 2 3)
            (2 3 7 6)
            (4 5 6 7)
            (1 2 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
